{
  "bands": {
    "jsonrpc": "2.0",
    "id": null,
    "result": [
      {
        "group": {
          "name": "Flabbercasters"
        },
        "bio": {
          "website": "https://flabbercasters.bandcamp.com",
          "facebook": "https://facebook.com/flabbercasters",
          "desc": "Baltimore's Favorite Wizard-Pop band.",
          "twitter": "",
          "pic_url": "/uber/guests/view_bio_pic?id=d5fd1b5c-f43a-4e75-b500-73528957017e"
        }
      },
      {
        "group": {
          "name": "Viking Guitar"
        },
        "bio": {
          "website": "http://vikingguitar.com",
          "facebook": "http://www.facebook.com/vikingguitar",
          "desc": "Erik Peabody is a composer and audio engineer from Santa Cruz, California. As \"Viking Guitar', he takes old-school video game music and reforges them as blistering, molten metal! Grab your axe, grow a beard, and join Viking Guitar for high-energy nostalgia! KEEP THE WORLD METAL!",
          "twitter": "http://www.twitter.com/vikingguitar",
          "pic_url": "/uber/guests/view_bio_pic?id=3a92eda4-4057-4392-a853-af1472636966"
        }
      },
      {
        "group": {
          "name": "Thrillkiller"
        },
        "bio": {
          "website": "http://www.thrillkiller.net/",
          "facebook": "https://www.facebook.com/ThrillkillerMusic/",
          "desc": "After  the  success  of  their  debut  music  video,  The  King  of  1984,  Thrillkiller  was  back  to  work  at  new  releases  and  a  follow  up  video  based  off  of  their  new  single,  San  Francisco  Moto.  Like  the  last  video,  Thrillkiller  launched  a  successful  Kickstarter  campaign  to  let  fans  take  part  in  the  creation  process  of  this  upcoming  music  video  event  followed  by  a  summer  tour  along  the  east  coast.  \"I  can't  think  of  anything  that  sounds  like  this\"  Gary  Thorn,  Shockwave  Magazine\"If  you  are  a  fan  of  music  at  all,  you  owe  it  to  yourself  to  give  Thrillkiller  a  listen  and  meet  your  new  favorite  band  of  2016.\"  C.,  Metal  To  Infinite  Webzine\"Thrillkiller  has  the  chance  to  be  the  breakout  band  of  2016\"  Andy  Davis,  Heavy  Metal  Time  Machine\"Every  track,  member,  and  part  absolutely  slays,  taking  a  wander  down  through  the  different  levels  of  writing  and  mix  never  becomes  boring.  This  is  no  cheap  mock  up  behind  a  single  individual,  nor  a  gilded  lily.\"  Si  Marks,  You  Can  Find  Me  On  The  EdgeTheir  members  have  shared  the  stage  with  acts  such  as  The  Protomen,  Sebastian  Bach,  Metal  Church,  Stratovarius,  Pagan's  Mind,  Symphony  X,  and  many  more.  Exploding  on  the  scene  in  the  fall  of  2015,  mixing  elements  of  metal,  rock,  pop  and  others,  Thrillkiller  delivers  a  viciously  unique  style  of  music.  With  the  launch  of  their  debut  EP,  Time  in  January  of  2016,  followed  by  their  totally  fan  funded  debut  release,  Showdown  in  summer  of  2016.  In  2017  and  2018  the  band  created  two  back  to  back  cinematic  music  videos  alongside  their  upcoming  EP,  San  Francisco  Moto.",
          "twitter": "https://twitter.com/thrillkillerx",
          "pic_url": "/uber/guests/view_bio_pic?id=9cb483c1-c637-4847-855c-35198e28070e"
        }
      },
      {
        "group": {
          "name": "Cowabunga Pizza Time"
        },
        "bio": {
          "website": "cowabungapizzatime.bandcamp.com",
          "facebook": "facebook.com/cowabungapizzatime",
          "desc": "Back from the sewers, Cowabunga Pizza Time returns to Maglabs armed to the teeth with high kicks, fast licks, denim vests and ninja tricks. the Baltimore based ninja warriors could not be more excited to come party with the Mag ninjas after a recent tear of epic performances at Magstock and Bit Gen gamer fest XIII and have plans to knock your socks off with their special brand gooey cheese covered ninja rock n roll sprinkled with a dash of nerdy nuance. So grab your best denim vest, toss on some shades and a headband and come party with Cowabunga pizza Time, oh and skip dinner - these ninjas give out free pizza at every show.",
          "twitter": "N/A",
          "pic_url": "/uber/guests/view_bio_pic?id=abe3b44d-9ec3-4297-9310-37dd50f5dde2"
        }
      },
      {
        "group": {
          "name": "Crunk Witch"
        },
        "bio": {
          "website": "https://crunkwitch.bandcamp.com",
          "facebook": "https://facebook.com/crunkwitchmusic",
          "desc": "Crunk Witch is an electro-pop duo from Presque Isle, ME. The band was formed in 2009 by married couple Brandon Miles and Hannah Colleen. \r\n\r\n\"One of the best bands from Maine.\"\r\n- Paste Magazine\r\n\r\n\"A big sound showcasing a mastery of production and vocal fireworks.\"\r\n- The Big Takeover\r\n\r\n\"Crunk Witch are dramatic in all the right ways. Silly, sincere, and wholly invested.\"\r\n- Portland Phoenix\r\n\r\n\"The most energetic live show I've seen in years\"\r\n- DC Underground\r\n\r\nTheir music blends pop, rock, and various electronic genres. Many of their lyrics are set in a science fiction reality and involve themes of adventure and romance. The group spends nearly half a year performing at events such as: SXSW, PAX, MAGFest and various other venues across the U.S. Crunk Witch has released four full-length albums, including their 2018 self-titled release, and sold over 30,000 albums and singles worldwide.",
          "twitter": "",
          "pic_url": "/uber/guests/view_bio_pic?id=9edf844e-65e0-485d-9f8e-4e2be594fee8"
        }
      },
      {
        "group": {
          "name": "Knight of the Round"
        },
        "bio": {
          "website": "knightoftheround.com",
          "facebook": "facebook.com/kotrmetal",
          "desc": "Regular Bio:\r\nBased out of the Chicagoland area, Knight of the Round are unlike most Video Game Music bands you may have heard. Their arrangements pay homage to the memorable Final Fantasy soundtracks while bringing an assault of two crushing 8-string guitars, grinding and thunderous bass, and aggressive polyrhythmic percussion with hard hitting blast beats. Spanning over a wide variety of the metal genre from classic thrash to modern progressive metal, the four piece delivers many iconic themes from Final Fantasy in the heaviest way possible.\r\n\r\nShorter Bio:\r\nHailing from Northwest Indiana, Knight of the Round draws influences from every bit of the heavy metal spectrum.  KOTR has brought a fresh approach to video game music since its inception 6 years ago while paying homage to one of the most notable game franchises of all time, Final Fantasy.",
          "twitter": "twitter.com/kotrmetal",
          "pic_url": "/uber/guests/view_bio_pic?id=7209b167-5921-4240-ae3a-461ae91b85ff"
        }
      },
      {
        "group": {
          "name": "LOVE SPREAD"
        },
        "bio": {
          "website": "lovespread.tokyo",
          "facebook": "https://www.facebook.com/wearelovespread/",
          "desc": "LOVE SPREAD is an electronic noise rock /Post J-POP project based out of Brooklyn, NY formed by Japanese artists Ryota and Narumi. Through a blend of distorted 8 bit chip sounds, noisy guitar tones and infectious J-pop influenced melodies, the duo have been winning the hearts and allegiances of listeners to get trapped in their sonic vortex. They have exploded onto the New York DIY scene off the strength of early series of demos and extremely energetic/chaotic live shows throughout in/out of the city.",
          "twitter": "https://twitter.com/wearelovespread",
          "pic_url": "/uber/guests/view_bio_pic?id=cb02db05-6676-4a37-8c92-554157d8c8b6"
        }
      },
      {
        "group": {
          "name": "Master Sword"
        },
        "bio": {
          "website": "http://www.masterswordband.com",
          "facebook": "https://www.facebook.com/masterswordband/",
          "desc": "Hailing from Maryland, Master Sword is a 5-piece heavy metal band inspired by music from \"The Legend of Zelda\" series. Taking influence from an array of hard rock to progressive metal favorites, the band crafts catchy original music with the melodies you all know and love.",
          "twitter": "https://twitter.com/masterswordband",
          "pic_url": "/uber/guests/view_bio_pic?id=c674255b-fd92-4271-98b4-253352263f40"
        }
      },
      {
        "group": {
          "name": "Smoochyface"
        },
        "bio": {
          "website": "http://smoochyface.com/",
          "facebook": "https://www.facebook.com/thesmoochyface",
          "desc": "Smoochyface is an indie band based in Atlanta, GA. Incorporating narrative elements from video games, cartoons, & comic books, Smoochyface combines the churn of fuzzy guitars with live improvisation for a unique experience in geek rock.",
          "twitter": "https://twitter.com/rgmuse",
          "pic_url": ""
        }
      },
      {
        "group": {
          "name": "Steel Samurai"
        },
        "bio": {
          "website": "https://steelsamurai.bandcamp.com/",
          "facebook": "https://www.facebook.com/steelsamuraiband/",
          "desc": "Steel Samurai has since December 2013 dug up the most ancient, obscure video game compositions and re-forged them into brutal-yet-richly-textured power-rock instrumentals with delicately layered guitar harmonies, jazzy organ riffs and skull-pounding rhythms.",
          "twitter": "https://www.twitter.com/SteelSamuraivgm",
          "pic_url": "/uber/guests/view_bio_pic?id=33d52fcd-cae3-4325-bb84-e375d8743efb"
        }
      },
      {
        "group": {
          "name": "Kenzie Black"
        },
        "bio": {
          "website": "http://artistecard.com/kenzieblack",
          "facebook": "facebook.com/notcoolkenz",
          "desc": ".｡:+*Kenzie Black was first known as a edm videographer, and in less than two years she has become an international DJ & producer inspired by やみ かわいい (Yami Kawaii Fashion) & Japanese music. She mixes dark & cute bass house, dubstep, & trap beats with video game & anime remixes in a new refreshing way.",
          "twitter": "twitter.com/notcoolkenz",
          "pic_url": "/uber/guests/view_bio_pic?id=7cc8676b-5344-49ae-9b73-c5ff60300b30"
        }
      },
      {
        "group": {
          "name": "Chipocrite"
        },
        "bio": {
          "website": "www.chipocrite.com",
          "facebook": "www.facebook.com/chipocrite",
          "desc": "Chipocrite uses original Nintendo Game Boys, often accompanied by guitar, bass, drums and/or other lo-fi sequencers, to create complex audio masterpieces. His multifaceted but catchy compositions combine the nostalgic game sounds of his childhood with modern music influences. Since emerging from the Philadelphia chiptune scene just a few years ago, Chipocrite has taken the stage at numerous performance spaces, events and conventions, including the Vans Warped Tour, Blip Festival, MAGFest, AnimeNEXT and Square Sounds Melbourne; provided soundtracks for commercials, video games and online videos; released \"Hit and Run\", which was named “Best Album – Chiptune” in Square Enix Music Online's Annual Game Music Awards for 2011, in addition to his first full-length album, “Wordplay,” in December 2014; appeared as the musical guest on popular tech-centric Web talk-show series “On The Verge” — and much more. He's also the creator and instructor of Soundfly.com's \"Chiptune Crash Course\" online music education series. Chipocrite is currently working on the soundtrack for “EarthNight,” a rogue-like runner game coming soon to PS4 and other platforms.",
          "twitter": "www.twitter.com/chipocrite",
          "pic_url": "/uber/guests/view_bio_pic?id=fae3acea-1105-4845-8904-097645d27c42"
        }
      },
      {
        "group": {
          "name": "NoisyBoys"
        },
        "bio": {
          "website": "",
          "facebook": "",
          "desc": "Versed in many genres of nerd-dom (and genres of electronic music), we just like to have fun! We try to keep bodies moving and having fun with us! Veterans around Raleigh, NC, and playing Animazement for 5 years running, we aim to please!  Anime, games, cartoons, you name it, we have music to spin from it!",
          "twitter": "",
          "pic_url": ""
        }
      }
    ]
  }
}