{
  "guests": {
    "jsonrpc": "2.0",
    "id": null,
    "result": [
      {
        "group": {
          "name": "Meg Eden"
        },
        "bio": {
          "website": "www.megedenbooks.com",
          "facebook": "facebook.com/megedenwritespoems",
          "desc": "Meg Eden teaches creative writing at Anne Arundel Community College. She has five poetry chapbooks, and her novel \"Post-High School Reality Quest\" is published with California Coldblood, an imprint of Rare Bird Books. Find her online at www.megedenbooks.com or on Twitter at @ConfusedNarwhal.",
          "twitter": "@ConfusedNarwhal",
          "pic_url": "/uber/guests/view_bio_pic?id=3033511f-2001-41e8-b1d5-d82233b86617"
        }
      },
      {
        "group": {
          "name": "Jonathan Bolding"
        },
        "bio": {
          "website": "https://www.pcgamer.com/board-games/",
          "facebook": "",
          "desc": "Jon Bolding has made the admittedly questionable decision of spending his adult life writing about video and tabletop games, these days as the Board Games editor at PC Gamer. He has otherwise appeared on sites like Zam and The Escapist.",
          "twitter": "https://twitter.com/JonBolds",
          "pic_url": "/uber/guests/view_bio_pic?id=134a2154-3a9c-47a4-aaa4-e33dcf8961d4"
        }
      },
      {
        "group": {
          "name": "+2 Comedy"
        },
        "bio": {
          "website": "plustwocomedy.wordpress.com",
          "facebook": "https://www.facebook.com/Plus2Comedy/",
          "desc": "+2 Comedy is the premiere geek culture stand-up comedy group on the East Coast.  +2 Comedy has been putting the \"stan\" in stand-up comedy at over seventy conventions and with a podcast totaling over 65,000 downloads.  Noah Houlihan, Laura Prince, and Will Liam are three lifelong nerds talking about the things they love.  Their YouTube show, Game the Gamer, has just finished filming after a successful Kickstarter campaign last summer.",
          "twitter": "@plus2comedy",
          "pic_url": "/uber/guests/view_bio_pic?id=f80e0c62-9d25-447f-a155-dee7f5a28291"
        }
      },
      {
        "group": {
          "name": "Corey Olsen"
        },
        "bio": {
          "website": "signumuniversity.org; tolkienprofessor.com",
          "facebook": "Signum University; The Tolkien Professor",
          "desc": "Corey Olsen is the President of Signum University, and he has been running his podcast, the Tolkien Professor, for almost ten years.",
          "twitter": "@tolkienprof",
          "pic_url": ""
        }
      },
      {
        "group": {
          "name": "Content Productions"
        },
        "bio": {
          "website": "https://www.twitch.tv/contentproductions",
          "facebook": "",
          "desc": "The ridiculous game masters of Content Productions have been bringing their interactive experiments to MAGFest events for over a decade. From game shows and collaborative speed runs to improv comedy and role playing adventures, Content Productions specializes in events with heavy audience participation and unexpected twists.",
          "twitter": "contentproduct",
          "pic_url": "/uber/guests/view_bio_pic?id=41f22fe4-1a00-4764-bec0-e2664280f78e"
        }
      },
      {
        "group": {
          "name": "Kevin Ryan"
        },
        "bio": {
          "website": "http://contraptionmaker.com/",
          "facebook": "https://www.facebook.com/kevin.ryan.1840",
          "desc": "Kevin first started making computer games 40 years ago on a 8kb computer. He was one of Dynamix's owners and worked on many games including Arctic Fox which was the first original game for the Amiga computer. He was the designer and programmer of The Incredible Machine.\r\n\r\nA few of his other games are Skyfox II, F-14 Tomcat, Heart of China, Rise of the Dragon, The Incredible Machine, 3D Ultra Minigolf, Marble Blast, and Contraption Maker. They were published by various companies including Electronic Arts, Activision, and Sierra.\r\n\r\nHe lives high up in the Sierra Nevada mountains with is wife and kids. He shovels lots of snow in the winter and drinks ale (some he brewed himself) year round.",
          "twitter": "https://twitter.com/TopMdw",
          "pic_url": "/uber/guests/view_bio_pic?id=ae65016a-c92c-4c93-8cab-fc313b3bdbe4"
        }
      },
      {
        "group": {
          "name": "Wes Johnson"
        },
        "bio": {
          "website": "www.wesjohnson.com",
          "facebook": "facebook.com/wesjohnsonactor",
          "desc": "Wes Johnson sleeps rather soundly for a murderer. Or wait, maybe that's one of his characters. The lines tend to blur.\r\n\r\nWes goes by many other names: Sheogorath. Lucien Lachance. The Silver Shroud. Fawkes. Moe Cronin. Herameus Mora. Imperial Guards. Hey You! Just to name a few. Here are a few details...\r\n\r\nWes was the guy who welcomed you off the boat in Bethesda Game Studio's \"MORROWIND.\" He was both the Criminal Scum and the Guards who arrested them in \"OBLIVION\" as well as a Daedric Price of Madness named Sheogorath. Wes returned to Tamriel and the Elder Scrolls series in \"SKYRIM\", reprising Sheo, Lucien, and Hermaeus Mora. He reprised his Arena Announcer and Sheogorath from Oblivion in ELDER SCROLLS LEGENDS.\r\n\r\nWes was every protectron Robot, fought for JUSTICE as The Silver Shroud and sold \"Swattahs\" the wastelands of \"FALLOUT 4.\" Wes stole your kills as Fawkes, swayed you to to do evil as Mr Burke, and bitched a lot as Scribe Bigsley in in \"FALLOUT 3.\" He fought famous Starship Captains as Klingons in \"STAR TREK: LEGACY and CONQUEST, can recently be found in \"World of Warcraft,\" and has been proudly UNLEASHING THE FURY and calling goals for the Stanley Cup Champion WASHINGTON CAPITALS since the turn of the Century. There are many things he cannot talk about... YET.\r\n\r\nWes has been SEEN as well as heard in feature films such as John Waters' \"A Dirty Shame,\" Chris Rock's \"Head of State,\" \"The Invasion,\" \"For Richer or Poorer,\" and has made appearances on HBO's \"VEEP,\" \"The Wire,\" and NBC's \"Homicide: Life on the Street.\" He recently shot a TV pilot with the great Ed Asner.\r\n\r\nA comedian and impressionist, Wes worked morning radio at WHFS-FM, was the comedy co-host on a national radio show with the late Wolfman Jack, and has performed songs on \"The Doctor Demento Show.\" In the end, Wes is happiest about his role as husband to Kim and father to Ben, Sam and Max. He DOES NOT actually live in a mansion, but fakes it well on YouTube. He is owned by a spoiled Chi-weenie.",
          "twitter": "@wesjohnsonvoice",
          "pic_url": "/uber/guests/view_bio_pic?id=9f2b270e-e01b-4cfe-9f16-5c7560067974"
        }
      },
      {
        "group": {
          "name": "Steven Long"
        },
        "bio": {
          "website": "ww.stevenslong.com",
          "facebook": "https://www.facebook.com/steven.s.long.7",
          "desc": "Steven S. Long is a writer and game designer who’s worked primarily in the tabletop roleplaying game field for the past twenty-five years. During that time he’s written or co-written approximately 200 RPG books. He’s best known for his work with Champions and the HERO System, but has worked for many other RPG companies including Last Unicorn Games, Pinnacle Entertainment Group, Decipher, and White Wolf. In recent years he’s branched out into writing fiction as well, and his first major work of non-fiction, a book on the Norse god Odin for Osprey Publishing, was released in May 2015. His Master Plan for World Domination has reached Stage 72-Delta.\r\n\r\nYou can find out more about Steve and what he’s up to at www.stevenslong.com.",
          "twitter": "@StevenSLong",
          "pic_url": "/uber/guests/view_bio_pic?id=86b4e30b-1630-4a48-838d-c1615c75c0c4"
        }
      },
      {
        "group": {
          "name": "Mike Rosson"
        },
        "bio": {
          "website": "",
          "facebook": "https://www.facebook.com/michael.a.rosson",
          "desc": "A mirthful, piratical lad, Mike Rosson is an endless font of fun voices and outrageous humor. Mike put both to good use as the Cap’n Cable half of the legendary comedy duo The Video Pirates. Mike comes full circle at NOT CON AT SEA, and may run a scaliwag through, so have a care ye!\r\n\r\nMike’s vocal versatility has served him well in games, as he ruled the wastelands in FALLOUT 4 as the Minuteman Radio Voice and the Vault Tech Scientist, and in FALLOUT 3 as Colin Moriaty, Dr Lesko, Gob and all male Ghouls. Mike took to space and battled all five legendary original Starfleet Captains as various Klingons, Romulans, Cardassians and Borg in Star Trek: Legacy & Star Trek Conquest. Visually, he has appeared in films such as John Waters’ “A Dirty Shame” and the cult classic “The Better Half.”\r\n\r\nNever to be found without his trusty ukulele at his side, Mike has written songs and recorded backup vocals with the band The Pheromones.  He has performed on The Doctor Demento Show, and improvised several classic bits on air live with the late, great Wolfman Jack on his nationally syndicated show.  Mike can be seen playing some wicked bluegrass with his band “5:30 Somewhere.”\r\n\r\nMike has a tender heart, a quick wit, and is a pushover for the select few who call him by the nickname “Dad.” YOU however, can call him Mike. or if ye want to survive, address him as \"Cap’n.\"",
          "twitter": "@MikeRossonVoice",
          "pic_url": "/uber/guests/view_bio_pic?id=eecec7b5-4046-4273-9a9e-89daf39df4bf"
        }
      },
      {
        "group": {
          "name": "Ed Habib"
        },
        "bio": {
          "website": "",
          "facebook": "",
          "desc": "Edmund \"Ed\" Habib is a pre-apollo rocket engineer. At 92, his career isn't over, he's still being called upon by the head of NASA. Vangaurd, TDRS, GPS, V2, Viking, Aerobee, Minitrack Tracking system, you name it, he built it, invented it, or Payload Managed it. Branch Head of Goddard, he designed/built Goddard's datacenters, converting streams of analog satelite data to digital.",
          "twitter": "",
          "pic_url": "/uber/guests/view_bio_pic?id=da67d241-9b4f-4b6b-aac4-0cd58ec1fabd"
        }
      },
      {
        "group": {
          "name": "Ryan Amon"
        },
        "bio": {
          "website": "www.ryanamon.com",
          "facebook": "",
          "desc": "Ryan Amon is an American composer born in Elkhorn, Wisconsin, where he began composing music at an early age with a background in classical piano and saxophone.  He is an alumnus of the McNally Smith College of Music in St. Paul, Minnesota, where his academic focus featured songwriting, composition, and motion imaging.\r\n\r\nAfter receiving the Pete Carpenter Fellowship from BMI in 2003, where he studied television music under composer Mike Post, Ryan moved to Los Angeles.  He soon became a ghostwriter and library music composer for various television shows including The Apprentice, The Biggest Loser, American Idol, Shark Tank, The Oprah Winfrey Show, America's Got Talent, and Dancing with the Stars, to name but a few.  His path would later take him over 5,000 miles away to the edge of the eastern Amazon basin of Bolivia, where his wife Carla’s family resides.  It was during this period while living in Santa Cruz, Bolivia that he was first inspired to form his own personal music project which later became the motion picture advertising company ‘City of the Fallen’ in 2009 - a company who's music would go on to be featured in various movie trailers including Marvel's \"The Avengers\".\r\n\r\n\r\n\r\nIn 2011 Ryan was contacted by director Neill Blomkamp to provide music for his dystopian feature film 'Elysium'.  The film would lead to a variety of experimentation, including incorporating the calls of colobus monkeys and baboons, the buzzing of mosquitos, and Mongolian throat singing.  The hybrid score would also feature the London Philharmonia Orchestra and be recorded at Abbey Road Studios.  In 2014, director Michael Mann would reach out to Ryan to compose music for his cyberthriller feature film 'Blackhat', featuring talented musicians from Bratislava, Slovakia. \r\n\r\n\r\n\r\nIn addition to feature film work, he has also composed music for FromSoftware's gothic/victorian video game 'Bloodborne', which was recorded at London's AIR Studios, and Ubisoft's franchise video game 'Assassins Creed: Unity\".  In the fall of 2015, the world premiere suite of his themes from 'Bloodborne' was performed live in concert in Stockholm, Sweden.",
          "twitter": "",
          "pic_url": "/uber/guests/view_bio_pic?id=92fd1dd0-c208-42b4-852a-0fb93aebefab"
        }
      },
      {
        "group": {
          "name": "Yoga for Gamers"
        },
        "bio": {
          "website": "yogaforgamers.com",
          "facebook": "facebook.com/yogaforgamers",
          "desc": "Yoga for Gamers uses video game music plus amped-up awareness of the body, mind, and breath to reboot your convention-and-computer-weary system. Participants learn to observe the skills they have already developed through their love of gaming. From there, they can live a more empowered, intentional, balanced, and skillful life-- both on and off the many \"screens\" of our lives.",
          "twitter": "",
          "pic_url": "/uber/guests/view_bio_pic?id=fa4d9d4d-b8b7-4aed-8547-d7cacd6e7c08"
        }
      }
    ]
  }
}
